Example 1

In [1]:
import pandas as pd
  
# Create the dataset
data = {'Name': ['Jai', 'Princi', 'Gaurav', 
                 'Anuj', 'Ravi', 'Natasha', 'Riya'],
        'Age': [17, 17, 18, 17, 18, 17, 17],
        'Gender': ['M', 'F', 'M', 'M', 'M', 'F', 'F'],
        'Qualification': [90, 76, 'NaN', 74, 65, 'NaN', 71]}
  
# Convert to data frame
df = pd.DataFrame(data)
df

      Name  Age Gender Qualification
0      Jai   17      M            90
1   Princi   17      F            76
2   Gaurav   18      M           NaN
3     Anuj   17      M            74
4     Ravi   18      M            65
5  Natasha   17      F           NaN
6     Riya   17      F            71

In [2]:
# Check the type
df.dtypes

Name             object
Age               int64
Gender           object
Qualification    object
dtype: object

In [3]:
# We converted the Qualification column to numerical
df['Qualification'] = df['Qualification'].apply(pd.to_numeric, errors='coerce')

In [4]:
# Check
df.dtypes

Name              object
Age                int64
Gender            object
Qualification    float64
dtype: object

In [5]:
# Replace nulls
df['Qualification'].fillna(df['Qualification'].mean(), inplace=True)
df

      Name  Age Gender  Qualification
0      Jai   17      M           90.0
1   Princi   17      F           76.0
2   Gaurav   18      M           75.2
3     Anuj   17      M           74.0
4     Ravi   18      M           65.0
5  Natasha   17      F           75.2
6     Riya   17      F           71.0

In [6]:
# We put 0 and 1 for gender
df['Gender'] = df['Gender'].map({'M': 0, 
                                 'F': 1, }).astype(int)
  
# Display data
df

      Name  Age  Gender  Qualification
0      Jai   17       0           90.0
1   Princi   17       1           76.0
2   Gaurav   18       0           75.2
3     Anuj   17       0           74.0
4     Ravi   18       0           65.0
5  Natasha   17       1           75.2
6     Riya   17       1           71.0

**Filtering data**: Suppose there is a requirement for details related to the name, gender and grades of the students with the best grades. Here we need to remove some unwanted data.

In [7]:
# Filtering the qualifications
df = df[df['Qualification'] >= 75]
  
# Remove age
df = df.drop(['Age'], axis=1)
  
# Display data
df

      Name  Gender  Qualification
0      Jai       0           90.0
1   Princi       1           76.0
2   Gaurav       0           75.2
5  Natasha       1           75.2

Example 2

In [8]:
import pandas as pd
  
# Dataframe for students
details = pd.DataFrame({
    'ID': [101, 102, 103, 104, 105, 
           106, 107, 108, 109, 110],
    'NAME': ['Jagroop', 'Praveen', 'Harjot', 
             'Pooja', 'Rahul', 'Nikita',
             'Saurabh', 'Ayush', 'Dolly', "Mohit"],
    'BRANCH': ['CSE', 'CSE', 'CSE', 'CSE', 'CSE', 
               'CSE', 'CSE', 'CSE', 'CSE', 'CSE']})
  
# Dataframe for debt
fees_status = pd.DataFrame(
    {'ID': [101, 102, 103, 104, 105, 
            106, 107, 108, 109, 110],
     'PENDING': ['5000', '250', 'Al dia', 
                 '9000', '15000', 'Al dia',
                 '4500', '1800', '250', 'Al dia']})
  
# Merging Dataframe
print(pd.merge(details, fees_status, on='ID'))

    ID     NAME BRANCH PENDING
0  101  Jagroop    CSE    5000
1  102  Praveen    CSE     250
2  103   Harjot    CSE  Al dia
3  104    Pooja    CSE    9000
4  105    Rahul    CSE   15000
5  106   Nikita    CSE  Al dia
6  107  Saurabh    CSE    4500
7  108    Ayush    CSE    1800
8  109    Dolly    CSE     250
9  110    Mohit    CSE  Al dia

Example 3

In [10]:
car_selling_data = {'Brand': ['Maruti', 'Maruti', 'Maruti', 
                              'Maruti', 'Hyundai', 'Hyundai', 
                              'Toyota', 'Mahindra', 'Mahindra', 
                              'Ford', 'Toyota', 'Ford'],
                    'Year':  [2010, 2011, 2009, 2013, 
                              2010, 2011, 2011, 2010, 
                              2013, 2010, 2010, 2011],
                    'Sold': [6, 7, 9, 8, 3, 5, 
                             2, 8, 7, 2, 4, 2]}
  

# Check types 
type(car_selling_data)

dict

In [11]:
# Convert to data frame
df = pd.DataFrame(car_selling_data)

In [12]:
# Group by Year
grouped = df.groupby('Year')
grouped = df.groupby(df['Year'])
grouped.head()

       Brand  Year  Sold
0     Maruti  2010     6
1     Maruti  2011     7
2     Maruti  2009     9
3     Maruti  2013     8
4    Hyundai  2010     3
5    Hyundai  2011     5
6     Toyota  2011     2
7   Mahindra  2010     8
8   Mahindra  2013     7
9       Ford  2010     2
10    Toyota  2010     4
11      Ford  2011     2

In [13]:
# Show only those records that belong to the year 2010.
print(grouped.get_group(2010))

       Brand  Year  Sold
0     Maruti  2010     6
4    Hyundai  2010     3
7   Mahindra  2010     8
9       Ford  2010     2
10    Toyota  2010     4